# Sector

## Set up

In [5]:
import pandas as pd
import os

from utils import read_stock, read_sector

## Constants

In [6]:
# path of the project
PATH = os.getcwd()

# Default start and end dates
START = "2017-02-01"
END = "2022-01-30"
START_DATE = pd.to_datetime(START)
END_DATE = pd.to_datetime(END)

## Get Sector Stocks

In [21]:
sector_df = read_sector(PATH + "/stock_sectors.csv")

# split the df into the different sector.
indus_df = sector_df.loc[sector_df['Sector'] == "Industrial"]
health_df = sector_df.loc[sector_df['Sector'] == "Healthcare"]
it_df = sector_df.loc[sector_df['Sector'] == "Information Technology"]
comm_df = sector_df.loc[sector_df['Sector'] == "Communication"]
staple_df = sector_df.loc[sector_df['Sector'] == "Staples"]
utility_df = sector_df.loc[sector_df['Sector'] == "Utilities"]
financial_df = sector_df.loc[sector_df['Sector'] == "Financials"]
material_df = sector_df.loc[sector_df['Sector'] == "Materials"]
restate_df = sector_df.loc[sector_df['Sector'] == "Real Estate"]
energy_df = sector_df.loc[sector_df['Sector'] == "Energy"]

In [22]:
def get_cum_ret_for_stocks(stock_df):
    tickers = []
    cum_rets = []

    for _, row in stock_df.iterrows():
        df = read_stock(row.name, PATH + "/stocks/")

        if df is None:
            pass
        else:
            tickers.append(row.name)
            cum = df['cum_return'].iloc[-1]
            cum_rets.append(cum)
    return pd.DataFrame({'Ticker':tickers, 'CUM_RET':cum_rets})

In [ ]:
industrial = get_cum_ret_for_stocks(indus_df)
health_care = get_cum_ret_for_stocks(health_df)
it = get_cum_ret_for_stocks(it_df)
commun = get_cum_ret_for_stocks(comm_df)
staple = get_cum_ret_for_stocks(staple_df)
utility = get_cum_ret_for_stocks(utility_df)
finance = get_cum_ret_for_stocks(financial_df)
material = get_cum_ret_for_stocks(material_df)
restate = get_cum_ret_for_stocks(restate_df)
energy = get_cum_ret_for_stocks(energy_df)

## Top Industrials

In [26]:
industrial.sort_values(by=['CUM_RET'], ascending=False).head(10)

    Ticker    CUM_RET
251   PLUG  18.392157
27    AMRC   8.953398
146   GNRC   6.626087
71    CALX   6.545454
99    CWST   6.511790
63    BLDR   6.138760
348   ZBRA   5.962595
224   NOVT   5.881597
327   VICR   5.712957
242    PAR   5.420155

## Top Healthcare

In [27]:
health_care.sort_values(by=['CUM_RET'], ascending=False).head(10)

    Ticker    CUM_RET
63    ARWR  28.787356
526   ZYXI  27.232722
326   MRTX  22.147059
364   OPRX  17.580087
117   CDNA  16.387234
174   DRNA  15.047245
98    BLFS  15.027322
275   JYNT  13.538874
204   FATE  12.897888
492   VCEL  12.558490

## Top IT

In [28]:
it.sort_values(by=['CUM_RET'], ascending=False).head(10)

    Ticker    CUM_RET
93    ENPH  82.026491
28    APPS  55.597218
285    TTD  21.493747
250   SEDG  16.764428
3     ACMR  13.233929
99    ETSY  11.713483
172    MDB  11.632366
311     WK   9.326613
19     AMD   8.726368
134   HUBS   8.639016

## Top Coms

In [29]:
commun.sort_values(by=['CUM_RET'], ascending=False).head(10)

   Ticker   CUM_RET
72   TTGT  8.898978
59   ROKU  6.435319
12   CDLX  4.529544
47    LYV  3.697576
38   IRDM  3.593846
80   ZNGA  3.400000
76     VG  3.023222
55    NYT  2.956080
73   TTWO  2.920162
5    BAND  2.880500

## Top Staples

In [31]:
staple.sort_values(by=['CUM_RET'], ascending=False).head(10)

   Ticker   CUM_RET
19   FRPT  8.126606
15    DAR  5.218802
12   COST  3.407955
55   SMPL  2.860833
5      BJ  2.633182
67    WMT  2.297908
38    MKC  2.253797
48   SAFM  2.117742
23    HSY  2.100277
0     ADM  2.018715

## Top Utilities

In [34]:
utility.sort_values(by=['CUM_RET'], ascending=False).head(10)

   Ticker   CUM_RET
32   MSEX  2.991857
33    NEE  2.661418
42   PCYO  2.413333
7     AWK  2.402669
8     AWR  2.309471
13    CPK  2.284615
26   GWRS  2.092289
58    XEL  1.986620
14    CWT  1.975729
57    WEC  1.966069

## Top Finance

In [33]:
finance.sort_values(by=['CUM_RET'], ascending=False).head(10)

    Ticker    CUM_RET
34    ATLC  23.487180
266   KNSL   6.872748
304   MSCI   6.387381
213   GSHD   5.930121
430   TBBK   5.510000
446   TRUP   5.477019
228   HLNE   5.209994
28    ARES   4.770652
279   LPLA   4.531062
381   RILY   4.450234

## Top Materials

In [35]:
material.sort_values(by=['CUM_RET'], ascending=False).head(10)

    Ticker   CUM_RET
122    VRS  4.395283
68     LPX  3.659971
52     HCC  3.605661
15     BCC  3.469201
91     RFP  3.020770
100    SHW  2.947099
65     LIN  2.935679
117   UFPT  2.744082
13     AVY  2.741123
18     BLL  2.550079

## Top Real Estate

In [36]:
restate.sort_values(by=['CUM_RET'], ascending=False).head(10)

    Ticker    CUM_RET
97    IIPR  12.015845
155     PW   9.714286
168    RVI   6.849730
73    EXPI   4.246844
135   NXRT   3.942478
150    PLD   3.652643
1      ABR   3.627138
159   REXR   3.527727
171   SAFE   3.393445
28     BRT   3.341339

## Top Energy

In [38]:
energy.sort_values(by=['CUM_RET'], ascending=False).head(10)

    Ticker   CUM_RET
89     OAS  9.881146
67     LEU  6.956141
9     ASPN  6.262922
4     AMTX  5.280488
107   REGI  4.659172
33     EGY  3.475000
24     CRC  2.844742
88     NRG  2.642981
28    CWEN  2.548963
134   VTNR  2.530612